improved state machine.
